# Manipulation

In [1]:
import pandas as pd 
import sqlite3


def create_df(cursor):
    data = cursor.fetchall()
    column_names = [description[0] for description in cursor.description]
    df = pd.DataFrame(data, columns=column_names)
    return df


conn = sqlite3.connect(":memory:")

#### 1.

Create a table named friends with three columns:

- `id` that stores `INTEGER`
- `name` that stores `TEXT`
- `birthday` that stores `DATE`

In [2]:
st = """
    CREATE TABLE friends (
        id INTEGER,
        name TEXT,
        birthday DATE
    );
"""
conn.execute(st)

#### 2.

Beneath your current code, add Ororo Munroe to `friends`.

Her birthday is May 30th, 1940.

In [3]:
st = """
    INSERT INTO friends (id, name, birthday)
    VALUES (1, 'Ororo Munroe', '1940-05-30');
"""
conn.execute(st)

#### 3.

Let’s make sure that Ororo has been added to the database:

```sql
SELECT * 
FROM friends;
```


Check for two things:

Is `friends` table created?
Is Ororo Munroe added to it?

In [6]:
st = """
    SELECT * FROM friends;
"""
cursor = conn.execute(st)


create_df(cursor)

   id          name    birthday
0   1  Ororo Munroe  1940-05-30

#### 4.

Let’s move on!

Add two of your friends to the table.

Insert an `id`, `name`, and `birthday` for each of them.

In [5]:
st = """
    INSERT INTO friends (id, name, birthday)
    VALUES (2, 'Jean Grey', '1940-05-30');
"""
conn.execute(st)


st = """
    INSERT INTO friends (id, name, birthday)
    VALUES (3, 'Kitty Pryde', '1940-05-30');
"""
conn.execute(st)

#### 5.

Ororo Munroe just realized that she can control the weather and decided to change her name. Her new name is “Storm”.

Update her record in `friends`.

In [6]:
st = """
    UPDATE friends
    SET name = "Storm"
    WHERE  name = "Ororo Munroe";
"""
conn.execute(st)

#### 6.

Add a new column named `email`.

In [7]:
st = """
    ALTER TABLE friends
    ADD COLUMN email TEXT;
"""
conn.execute(st)

#### 7.

Update the email address for everyone in your table.

Storm’s email is `storm@codecademy.com`.

In [8]:
st = """
    UPDATE friends
    SET email = "storm@codecademy.com"
    WHERE  name = "Storm";
"""
conn.execute(st)


st = """
    UPDATE friends
    SET email = "jeangrey@codecademy.com"
    WHERE  name = "Jean Grey";
"""
conn.execute(st)


st = """
    UPDATE friends
    SET email = "kittypryde@codecademy.com"
    WHERE  name = "Kitty Pryde";
"""
conn.execute(st)

#### 8.

Wait, Storm is fictional…

Remove her from `friends`.

In [9]:
st = """
    DELETE FROM friends
    WHERE name = "Storm";
"""
conn.execute(st)

#### 9.

Great job! Let’s take a look at the result one last time:

In [10]:
st = """
    SELECT * FROM friends;
"""
cursor = conn.execute(st)


create_df(cursor)

   id         name    birthday                      email
0   2    Jean Grey  1940-05-30    jeangrey@codecademy.com
1   3  Kitty Pryde  1940-05-30  kittypryde@codecademy.com